### 모듈 가져오기

In [1]:
import pandas as pd

In [ ]:
df = pd.read_excel('orders.xlsx')

### order.xlsx에서 데이터프레임 변환

In [2]:
df = pd.read_excel('orders.xlsx')

In [3]:
df

    주문번호   제품명  수량  발주처
0      1  책상K1   4  A물산
1      2  의자S1   4  A물산
2      3  책장V2   2  A물산
3      4  책상K1   3  B물산
4      5  책상K2   3  B물산
5      6  의자S2   6  B물산
6      7  책장V1   5  B물산
7      8  책상K1   5  C물산
8      9  책상K2   5  C물산
9     10  의자S2  10  C물산
10    11  책장V1   3  C물산
11    12  책장V2   4  C물산

### 데이터 프레임 모양 확인

In [4]:
df.head(3)

   주문번호   제품명  수량  발주처
0     1  책상K1   4  A물산
1     2  의자S1   4  A물산
2     3  책장V2   2  A물산

### order_reference.xlsx에서 데이터프레임 변환

In [7]:
df_ref = pd.read_excel('order_reference.xlsx')

In [11]:
df_ref

    제품명      제품코드    제품가격
0  책상K1  D56712K1  400000
1  책상K2  D56712K2  450000
2  의자S1  C56712S1  200000
3  의자S2  C56712S2  230000
4  책장V1  B56712V1  150000
5  책장V2  B56712V2  100000

### 두 데이터프레임 통합

In [8]:
df_ref.head(1)

    제품명      제품코드    제품가격
0  책상K1  D56712K1  400000

In [16]:
df = df.merge(df_ref)

### 컬럼 순서 변경

In [17]:
df = df[['주문번호', '제품명', '제품코드','제품가격','수량','발주처']]

In [18]:
df

    주문번호   제품명      제품코드    제품가격  수량  발주처
0      1  책상K1  D56712K1  400000   4  A물산
1      4  책상K1  D56712K1  400000   3  B물산
2      8  책상K1  D56712K1  400000   5  C물산
3      2  의자S1  C56712S1  200000   4  A물산
4      3  책장V2  B56712V2  100000   2  A물산
5     12  책장V2  B56712V2  100000   4  C물산
6      5  책상K2  D56712K2  450000   3  B물산
7      9  책상K2  D56712K2  450000   5  C물산
8      6  의자S2  C56712S2  230000   6  B물산
9     10  의자S2  C56712S2  230000  10  C물산
10     7  책장V1  B56712V1  150000   5  B물산
11    11  책장V1  B56712V1  150000   3  C물산

### merge 이해하기

In [20]:
df_left = pd.DataFrame({
    'key' : ['k0', 'k1', 'k2', 'k3'],
    'value1' : ['a0', 'a1', 'a2', 'a3']
})

In [21]:
df_right = pd.DataFrame({
    'key' : ['k2', 'k3', 'k4', 'k5'],
    'value2' : ['b0', 'b1', 'b2', 'b3']
})

### 일단 머지해보기

In [22]:
df_left.merge(df_right)

  key value1 value2
0  k2     a2     b0
1  k3     a3     b1

### left merge

In [23]:
df_left.merge(df_right, how='left')

  key value1 value2
0  k0     a0    NaN
1  k1     a1    NaN
2  k2     a2     b0
3  k3     a3     b1

### right merge

In [24]:
df_left.merge(df_right, how='right')

  key value1 value2
0  k2     a2     b0
1  k3     a3     b1
2  k4    NaN     b2
3  k5    NaN     b3

### inner merge

In [25]:
df_left.merge(df_right, how='inner')

  key value1 value2
0  k2     a2     b0
1  k3     a3     b1

### outer merge

In [29]:
df_left.merge(df_right, how='outer')

  key value1 value2
0  k0     a0    NaN
1  k1     a1    NaN
2  k2     a2     b0
3  k3     a3     b1
4  k4    NaN     b2
5  k5    NaN     b3